{"title":"js-scripted-http","date":"2019-01-05T15:06:09.000Z","excerpt":"","slug":"js-scripted-http","comments":true,"tags":["javascript","note"],"categories":["language core"],"updated":"2019-01-05T15:27:17.644Z","content":"<blockquote>\n<p>This is the reading note for “Chapter 18: Scripted Http, Javascript: The definitive guide 5th edition”. <br></p>\n</blockquote>\n<p>HTTP requests are initiated when a script sets the <code>location</code> property of a window object or calls the <code>submit()</code> method of a form object. <br></p>\n<p>The key features of an Ajax application is that it uses scripted HTTP to initiate data exchange with a web server without causing pages to reload. A web application might use Ajax technologies to log user interaction data to the server or to improve its start-up time by displaying only a simple page at first and then downloading additional data and page components on an as-needed basis.<br></p>\n<p>In a sense, Comet is the reverse of Ajax: in Comet, it is the web server that initiates the communication, asynchronously sending messages to the client. If the web application needs to respond to these messages sent by the server, it can then use Ajax techniques to send or request data. In Ajax, the client “pulls” data from the server. With Comet, the server “pushes” data to the client. Other names for Comet include “Server Push”, “Ajax Push”, and “Http Streaming”.<br></p>\n<p>There are a number of ways to implement Ajax and Comet, fand these underlying implementations are sometimes known as <code>transports</code>. The <code>&lt;img&gt;</code> element, for example, has a <code>src</code> property. When a script sets the property to a URL, an HTTP GET request is initiated to download an image from that URL. A script can therefore pass information to a web server by encoding that information into the query-string portion of the URL of an image and setting the <code>src</code> property of an <code>&lt;img&gt;</code> element. The web server must actually retrun some images as a result of this request, but it can be invisible: a transparent 1 pixel by 1 pixel image, for instance. <br></p>\n<p>Event the <code>&lt;script&gt;</code> element has a <code>src</code> property that can be set to initiate an HTTP GET request. Doing HTTP scripting with <code>&lt;script&gt;</code> elements is particularly attractive because they are not subject to the same-origin policy and can be used for cross-domain communication. Usually, with a <code>&lt;script&gt;</code> based Ajax transport, the server’s response takes the form of JSON-encoded data that is automatically “decoded” when the script is executed by teh JS interpreter. Because of its use of the JSON data format, this Ajax transport is known as “JSONP”.</p>\n","next":{"title":"CSS Specificity and Cascade","slug":"css-specificity"},"link":"https://whitefusion.github.io/post/js-scripted-http"}