{"title":"Python: How do we run Python program","date":"2018-06-22T14:48:36.000Z","excerpt":"","slug":"How-do-we-run-Python-program","comments":true,"tags":["python","note"],"categories":["language core"],"updated":"2018-06-25T14:30:58.579Z","content":"<blockquote>\n<p>This is the reading note for “Chapter 3: how you run programs, Learning python 5th edition”. <br></p>\n</blockquote>\n<h2 id=\"Unix-Script-Basics\"><a href=\"#Unix-Script-Basics\" class=\"headerlink\" title=\"Unix Script Basics\"></a>Unix Script Basics</h2><p>One can turn Python into executable programs if it was used in Unix, Linux or Unix-like system. In simple terms, Unix-style executable scripts are just normal text files containing Python statements, but with two sepcial properties: </p>\n<ul>\n<li><strong>Their first line is special.</strong> Scripts usually start with a line that begins with the characters <code>#!</code> (often called hash bang or shebang), followed by the path to the Python interpreter on your machine. For example: <code>#!/usr/local/bin/python</code></li>\n<li><strong>They usually have executable privileges.</strong> On unix systems, a command like <code>chmod +x file.py</code> usually does the trick. </li>\n</ul>\n<p>The first speical line at the top of the file tells the system where the Python interpreter lives . </p>\n<h2 id=\"The-Unix-env-lookup-trick\"><a href=\"#The-Unix-env-lookup-trick\" class=\"headerlink\" title=\"The Unix env lookup trick\"></a>The Unix env lookup trick</h2><p>One can avoid hardcoding the path to the Python interperter in your script file by writing the special first-line comment like this:<code>#!/usr/bin/env python</code>. The <strong>env</strong> program locates the Python interpreter according to your system search path settings (in most Unix shells, by looking in all the directories listed in your <strong>PATH</strong> environment variable). </p>\n<h2 id=\"The-input-trick-on-Windows\"><a href=\"#The-input-trick-on-Windows\" class=\"headerlink\" title=\"The input trick on Windows\"></a>The input trick on Windows</h2><p>Assuming no IDLE associated with .py file, Python program files show up as icons in file explorer windows and can automatically be run with a double-click of the mouse. However, the console windows appears and prints , and disappers as the on program exit. You can barely see your output. <br><br>A trick to hack this is to add <code>input()</code> command at the end of your program. <strong>input</strong> reads and returns the next line of standard input, waiting if there is none yet available. </p>\n<h2 id=\"Module-imports-and-reloads\"><a href=\"#Module-imports-and-reloads\" class=\"headerlink\" title=\"Module imports and reloads\"></a>Module imports and reloads</h2><p><strong>import</strong> operations <em>run</em> the code in a file that is being loaded as a final step. However, in a single session, you cannot import the same file more than once. Since <strong>import</strong> is expensive, it must find files, compile them to byte code, and run the code. <br></p>\n<p>If you really want to force Python to run the file again in the same session without stopping and restarting the session, you need to instead call the reload function available in the <strong>imp</strong> standard library module. The <strong>reload</strong> function expects the name of an already loaded module object, so you have to have successfully imported a module once before you reload it. <strong>reload</strong> is a function that is called while <strong>import</strong> is a statement. </p>\n<h2 id=\"The-grander-module-story-attributes\"><a href=\"#The-grander-module-story-attributes\" class=\"headerlink\" title=\"The grander module story: attributes\"></a>The grander module story: attributes</h2><p>Import operations execute files as a last step. Modules serve the role of <em>libraries</em> of tools. A module is mostly just a package of variable names, known as <em>namespace</em>. the names within that package are called <em>attributes</em>. An attribute is simply a variable name that is attached to a specific object. The built-in <strong>dir</strong> function starts to come in handy - you can use it to fetch a list of all the names available inside a module. Names with leading and trailing double underscores (<code>__X__</code>)  are built-in names that are always predefined by Python. </p>\n<h2 id=\"Using-exec-to-Run-Module-Files\"><a href=\"#Using-exec-to-Run-Module-Files\" class=\"headerlink\" title=\"Using exec to Run Module Files\"></a>Using exec to Run Module Files</h2><p>The <code>exec(open(&#39;module.py&#39;).read())</code> built-in function call is another way to launch files from the interactive prompt without having to import and later reload. But it comes with the potential to silently overwrite variables you may currently be using.</p>\n","prev":{"title":"Javascript: Number, String, Boolean, Null & Undefined","slug":"Number-String-Boolean-Null-Undefined"},"next":{"title":"Javascript: Types, Values and Variables","slug":"types-values-variables-1"},"link":"https://whitefusion.github.io/post/How-do-we-run-Python-program"}